<html>

<head>
<LINK REL="Stylesheet" TYPE="text/css" HREF="stylesheet.css">
<title>Verwaltung der Datenbanken</title>
</head>

<body>
<h1>Verwaltung der Datenbanken</h1>
Das Men&uuml; "Werkzeuge/Datenbanken verwalten" &ouml;ffnet einen Dialog, in dem man Datenbanken und deren Eintr&auml;ge verwalten kann.

<h2>Sektion "Verwaltung"</h2>
<div style="float:right"><img src="de_manage_db_store.png"></div>
<p>Diese Lasche dient der Verwaltung von Eintr&auml;gen in den Datenbanken. Sie wird auch zum <a href="de_storage.htm">&Ouml;ffnen und Speichern</a> von Eintr&auml;gen genutzt.</p>

<p>Es werden zwei Datenbanken nebeneinander angezeigt. Aus der jeweiligen Dropdown-Liste (oben) kann man die Datenbank f&uuml;r rechts und links ausw&auml;hlen. In den gro&szlig;en Listen darunter werden die Konstrukte der Datenbank angezeigt.</p>

<p>Ein Doppelklick auf ein Konstrukt l&auml;dt dessen Daten, so dass man es betrachten und ggfs. ver&auml;ndern kann. Ein ver&auml;ndertes Konstrukt kann dann &uuml;ber das Menu "Datei/In Datanbank speichern" in einer der Datenbanken abgelegt werden. Dabei ist zu beachten, dass ein bereits existierendes Konstrukt <i>nicht</i> &uuml;berschrieben werden kann, falls es eine andere Sequenz hat; dazu muss f&uuml;r das Konstrukt ein neuer Name gew&auml;hlt werden.</p>

<p>Ein Klick mit der rechten Maustaste auf ein Konstrukt &ouml;ffnet ein Men&uuml;, in dem das gew&auml;hlte Konstrukt innerhalb der Datenbank umbenannt werden kann.</p>

<p>Mehrere Konstrukte k&ouml;nnen ausgew&auml;hlt werden, in dem die "Strg"-Taste w&auml;hrend der Auswahl mit der linken Maustaste gedr&uuml;ckt gehalten wird. Alternativ kann auch ein Eintrag ausgew&auml;hlt werden, und dann bei gedr&uuml;ckter Hochstell-Taste ein zweiter Eintrag. Alle Eintr&auml;ge vom ersten bis zum zweiten Eintrag werden dann markiert.</p>

<p>Gew&auml;hlte Konstrukte k&ouml;nnen &uuml;ber das Kontext-Men&uuml; (rechte Maustaste) umbenannt oder gel&ouml;scht werden.</p>

<p>Gew&auml;hlte Konstrukte k&ouml;nnen in die jeweils andere Datenbank verschoben oder kopiert werden. Dazu "greift" man die Objekte mit der linken Maustaste und zieht sie auf die Konstrukt-Liste der anderen Datenbank. Zum Kopieren die "Strg"-Taste gedr&uuml;ckt halten; ein kleines "+"-Zeichen erscheint am Mauspfeil.</p>

<h2>Sektion "Datenbanken"</h2>
<div style="float:right"><img src="de_manage_db_database.png"></div>
<p>Links ist eine Liste der bekannten Datenbanken zu sehen. Diese enth&auml;lt stets die lokale Datenbank. Weitere Datenbanken k&ouml;nnen &uuml;ber den Knopf "Hinzuf&uuml;gen" in die Liste aufgenommen und &uuml;ber den Knopf "Entfernen" wieder entfernt werden. Dabei werden nur Eintr&auml;ge in der Liste hinzugef&uuml;gt bzw. entfernt; die Datenbanken selbst bleiben dadurch unver&auml;ndert!</p>

<p>&Uuml;ber den Knopf "Als Standard" kann man eine der Datenbanken in der Liste zur Standard-Datenbank erkl&auml;ren. Diese Datenbank wird dann als Standard-Ziel beim Speichern von Eintr&auml;gen angegeben.</p>

<p>Der Sinn mehrerer Datenbanken ist, Eintr&auml;ge organisatorisch und/oder thematisch zu trennen, z.B. nach Arbeitsgruppe, Labor, Expressionssystem, etc. F&uuml;r kleinere Arbeitsgruppen ist eine einzige, zentrale Datenbank sinvoll.</p>

<center><a href="de_main.htm">Startseite</a></center>
</body>

</html>