<html>

<head>
<LINK REL="Stylesheet" TYPE="text/css" HREF="stylesheet.css">
<title>PCR und Primer Design</title>
</head>

<body>

<h1>PCR und Primer Design</h1>

Die PCR-Funktion wird von einer DNA-Sequenz aus &uuml;ber das Men&uuml; "Werkzeuge/PCR" oder &uuml;ber das Kontextmen&uuml; der Plasmidkarte aufgerufen. Ist ein Teil der Sequenz markiert, bietet das Kontextmenu zus&auml;tzlich die Funktionen "Vorw&auml;rte", "R&uuml;ckw&auml;rts" und "Beide" an, was sich auf die automatische Generierung von Anfangs- und End-Primern f&uuml;r die markierte Sequenz bezieht.
<p>Die PCR-Anzeige besteht aus Primerliste und -Details, sowie einer Sequenzbereich. Letzterer ist in Bl&ouml;cken zu 7 Zeilen arrangiert:</p>
<ol>
<li>5'-Primer</li>
<li>Original-DNA</li>
<li>Original-Aminos&auml;ure-Sequenz</li>
<li>Original-DNA (komplement&auml;r)</li>
<li>3'-Primer</li>
<li>Restriktionsschnittstellen f&uuml;r die</li>
<li>resultierende DNA-Sequenz</li>
<li>resultierende Aminos&auml;ure-Sequenz</li>
</ol>

<center><img src="de_pcr.png"></center>

<p>Dabei haben die Aminos&auml;ure-Sequenzen #3 und #7 setzt das gleiche Leseraster.
<p>Die Primer k&ouml;nnen &uuml;ber das Men&uuml; "Ansicht/Editiermodus" bzw. F2 bearbeitet werden. Ob 5'- oder 3'-Primer bearbeitet werden, h&auml;ngt von der letzten Auswahl mit der Maus ab.</p>
<p>Primer k&ouml;nnen &uuml;ber Buttons in der Toolbar exportiert und importiert werden. Exportierte Primer m&uuml;ssen gespeichert werden, was Namens&auml;nderungen erm&ouml;glicht. Um Primer zu importieren, m&uuml;ssen diese zun&auml;chst aus der Datenbank geladen werden.</p>
<p>Primer k&ouml;nnen auch semi-automatisch optimiert werden. Dazu wird &uuml;ber den Button "Bearbeiten" ein Dialog aufgerufen, in dem verschiedene Bedingungen f&uuml;r den Primer eingegeben werden k&ouml;nnen. Daraus wird dann automatisch eine Liste erstellt, in welcher der (nach Ansicht des Programms;-) beste Primer auf Position 1 steht. Dieser kann dann duch Doppelklick auf den Eintrag &uuml;bernommen werden.</p>
<p>&Uuml;ber das Kontext-Men&uuml; kann in einem eigenen Dialog eine stille Mutation gesucht werden. Dazu muss eine Sequenz (normalerweise ein Primer) ausgew&auml;hlt sein, und ein reading frame muss festgelegt worden sein, ansonsten steht die Funktion nicht zur Auswahl.</p>

<center><a href="de_main.htm">Startseite</a></center>
</body>

</html>