<html>

<head>
<LINK REL="Stylesheet" TYPE="text/css" HREF="stylesheet.css">
<title>Restriktionsverdau</title>
</head>

<body>
<h1>Restriktionsverdau</h1>
Der (simulierte) Restriktionsverdau einer DNA-Sequenz l&auml;uft in zwei Schritten ab. Zun&auml;chst werden alle f&uuml;r den Verdau ben&ouml;tighten Enzyme in einen "Cocktail" gegeben. Im zweiten Schritt wird dann die Restriktion gestartet, wobei die entsprechenden Fragmente entstehen. Die Namen der entstehenden Fragmente werden aus dem Sequenznamen sowie den verwendeten Restriktionsenzymen gebildet. Der Restriktionsverlauf wird der BEschreibung der Fragmente beigef&uuml;gt.</p>

<h2>Restriktionsverdau per Kontext-Men&uuml;</h2>
Ein Klick mit der rechten Maustaste auf eine Restriktionsschnittstelle in der Plasmidkarte &ouml;ffnet ein Kontextmen&uuml;. Darin finden sich die Punkte "Zum Cocktail hinzuf&uuml;gen" sowie "Zum Cocktail hinzuf&uuml;gen und schneiden". Befinden sich bereits Enzyme im Cocktail, so werden diese am Ende des Men&uuml;s angezeigt, ebenso wie der Men&uuml;punkt "Mit dem Cocktail schneiden".<p>

<h2>Restriktions-Assistent</h2>
Die linken Liste des Restriktions-Assistenten zeigt Enzyme, die zum Cocktail hinzugef&uuml;gt werden k&ouml;nnen. Der Ihnalt der Liste l&auml;sst sich &uuml;ber die dargestellte Enzymgruppe sowie einen "Schnittfilter" (alle, schneidende, nicht schneidende Enzyme) variieren. Die Liste l&auml;sst sich nach Enzymnamen bzw. Anzahl der Schnitte durch klicken auf den entsprechenden Tabellentitel sortieren.
<p>Wird ein Enzym ausgew&auml;hlt, werden links unten die Schnittprodukte <i>dieses Enzyms</i> dargestellt. Ein ausgew&auml;hltes Enzym kann durch den "Cocktail"-Button zum Cocktail hinzugef&uuml;gt werden.
<p>Die rechte Liste zeigt alle Enzyme, die sich gegenw&auml;rtig im Cocktail befinden. Rechts unten wird eine Liste mit allen resultirenden Schnittfragmenten <i>des gesamten Cocktails</i> angezeigt. Ein im Cocktail ausgew&auml;hltes Enzym kann durch "Entfernen" aus dem Cocktail gel&ouml;scht werden.
<p>Es kann eine Mindestl&auml;nge f&uuml;r entstehende Fragmente eingestellt werden, um kleine DNA-St&uuml;cke (z.B. eine ausgeschnittene Multi-Cloning-Site) direkt bei der Restriktion zu verwerfen. Die Standardeinstellung ist 20 Basenpaare.
<p>&Uuml;ber den "Fertig"-Button kann man zum Programm zur&uuml;ckkehren, <i>ohne</i> die Restriktion zu starten. Der Cocktail bleibt jedoch erhalten. "Abbruch" verwirft alle &Auml;nderungen, die seit dem Start des Assistenten vorgenommen wurden. Der "Schere"-Button schlie&szlig;lich startet die Restriktion.
<center><img src="de_restriction_assistant.png"></center>

<center><a href="de_main.htm">Startseite</a></center>
</body>

</html>