<html>

<head>
<LINK REL="Stylesheet" TYPE="text/css" HREF="stylesheet.css">
<title>Konstrukte bearbeiten</title>
</head>

<body>

<h1>Konstrukte bearbeiten</h1>
Konstrukte sind DNA-Sequenzen, die Vektoren, Restriktionsfragmente, Primer und manuell eingegebene Sequenzen umfassen. Ihre Verwaltung und Bearbeitung ist die Hauptfunktion von GENtle. Sie k&ouml;nnen aus der <a href="de_storage.htm">Datenbank</a> oder aus <a href="de_import.htm">Fremdformaten</a> ge&ouml;ffnet oder <a href="de_enter_sequence.htm">direkt eingegeben</a> werden.

<h2>Konstruktkarte</h2>
<div style="float:right;margin-left:5"><img src="de_plasmid.png"></div>
<p>Die Konstruktkarte stellt das Konstrukt graphisch dar, als Linie oder Kreis, je nachdem, ob das Konstrukt linear oder circul&auml;r ist. Auch werden <i>Features</i> und <i>Restriktionsschnittstellen</i> eingetragen.<br>
Ein Doppelklick mit der linken Maustaste auf eine freie Stelle der Plasmidkarte zeigt die Eigenschaften des Konstrukts dar, und l&auml;sst deren Bearbeitung zu.</p>

<p>Im Vektor kann man mit der linken Maustaste einen Teil der Sequenz markieren.</p>

<h3>Features</h3>
<p>Features sind definierte Bereiche des Konstrukts, wie z.B. Gene, codierende Sequenzen, <i>ori</i>s (Origin of Replication). Diese werden farbig dargestellt.</p>

<p>&Uuml;ber die linke Maustaste, die Men&uuml;s bzw. Kontextmen&uuml;s (mit der rechten Maustaste auf Features klicken) k&ouml;nnen mehrere Aktionen ausgef&uuml;hrt werden:</p>

<ul>
<li>Feature verschieben (linke Maustaste)</li>
<li>Feature bearbeiten (linke Maustaste, Doppelklick)</li>
<li>Feature markieren (Kontextmen&uuml; oder mittlere Maustaste)</li>
<li>Sequenz eines Feature ausschneiden bzw. kopieren (Kontextmen&uuml;)</li>
<li>Feature als neues Konstrukt (Kontextmen&uuml;)</li>
</ul>


<h3>Restriktionsschnittstellen</h3>
<p>Restriktionsschnittstellen sind die Positionen in der Sequenz, an denen eines oder meherer der vorher festgelegten Restriktionsenzyme schneiden k&ouml;nnen.</p>

<p>&Uuml;ber die linke Maustaste, die Men&uuml;s bzw. Kontextmen&uuml;s (mit der rechten Maustaste auf die Restriktionsschnittstelle klicken) k&ouml;nnen mehrere Aktionen ausgef&uuml;hrt werden:</p>

<ul>
<li>Restriktionsschnittstelle verschieben (linke Maustaste)</li>
<li>Restriktionsschnittstelle bearbeiten (linke Maustaste, Doppelklick)</li>
<li>Restriktionsschnittstelle markieren (Kontextmen&uuml;)</li>
<li>Restriktionsenzym zum Cocktail hinzuf&uuml;gen (Kontextmen&uuml;)</li>
<li>Restriktionsenzym aus dem Cocktail entfernen (Kontextmen&uuml;)</li>
<li>Mit dem Cocktail schneiden (Kontextmen&uuml;)</li>
<li>Cocktail bearbeiten (Kontextmen&uuml; bzw. mittlere Maustaste)</li>
</ul>

<h3>Leseraster</h3>
M&ouml;gliche Leseraster (<i>Open Reading Frames</i>, ORFs) k&ouml;nnen &uuml;ber Men&uuml;, Kontextmen&uuml;, oder die Taste F4 ein- und ausgeblendet werden. &Uuml;ber das Kontextmen&uuml; k&ouml;nnen ORFs auch geBLASTet und in neue Features (korierende Regionen) umgewandelt werden.

<h2>Sequenz</h2>
<div style="float:right;margin-left:5"><img src="de_sequence_dna.png"></div>
<p>Die Sequenz des Konstrukts enth&auml;lt mehrere Zeilen, je nach Einstellungen:</p>

<ul>
<li>Die Features</li>
<li>Die Aminos&auml;uresequenz</li>
<li>Die DNA-Sequenz</li>
<li>Die Restriktionsschnittstellen</li>
</ul>

<p>&Uuml;ber das Men&uuml; "Ansicht/Aminos&auml;uren darstellen" kann die Ansicht der Aminos&auml;uren ver&auml;ndert werden. Sie k&ouml;nnen entweder ganz ausgeblendet werden, in allen drei Leserastern als Ein-Buchstaben-Code dargestellt werden, per manuell festgelegtem Leseraster als Drei-Buchstaben-Code dargestellt werden, oder auf bekannte Leseraster beschr&auml;nkt werden. Letztere finden sich z.B. f&uuml;r kodierende Sequenzen in GenBank-Dateien. Sind solche bekannten Leseraster vorhanden, wird beim Aufrufen eines Konstrukts der "nur bekannte Leseraster"-Modus verwendet, sonst der Ein-Buchstaben-Code.</p>

<p>Die Sequenz kann &uuml;ber das Men&uuml; "Ansicht/Editiermodus" (oder &uuml;ber die Taste "F2") zwischen Darstellungs- und Editiermodus umgeschaltet werden. Im Editiermodus f&uuml;llt die Sequenz das gesamte Fenster aus. Die Sequenz kann nun wie in einer Textverarbeitung bearbeitet und ver&auml;ndert werden. Der Cursor kann mit Hilfe der Cursortasten oder der Maus bewegt werden.</p>


<center><a href="de_main.htm">Startseite</a></center>
</body>

</html>