<html>

<head>
<LINK REL="Stylesheet" TYPE="text/css" HREF="stylesheet.css">
<title>Vektoreigenschaften, Features und Restriktionsenzyme bearbeiten</title>
</head>

<body>
<h1>Vektoreigenschaften, Features und Restriktionsenzyme bearbeiten</h1>
<p>Der Dialog zum Bearbeiten von Vektoreigenschaften, Features und Restriktionsenzymen kann &uuml;ber Kontextmen&uuml;s in der Plasmid- und Sequenzkarte sowie &uuml;ber einen Doppelklick auf den "leeren" Plasmidhintergrund aufgerufen werden.</p>


<h2>Vektoreigenschaften bearbeiten</h2>
Hier k&ouml;nnen der Vektorname, Beschreibung, sowie die "sticky ends" bearbeitet werden.
<center><img src="de_vector_editor.png"></center>


<h2>Features bearbeiten</h2>
Hier h&ouml;nnen Name, Position, L&auml;nge, Typ, Beschreibung, Farbe und ggfs. Leseraster eines Features bearbeitet werden. Ebenso k&ouml;nnen Features gel&ouml;scht oder neue hinzugef&uuml;gt werden. Ein Doppelklick auf ein Feature in der Plasmidkarte startet diesen Dialog und w&auml;hlt das Feature zum Bearbeiten aus.
<center><img src="de_feature_editor.png"></center>


<h2>Restriktionsenzyme bearbeiten</h2>
<p>Hier k&ouml;nnen Restriktionsenzyme zur aktuellen Sequenz-Darstellung hinzugef&uuml;gt oder daraus entfernt werden. Die linke Liste zeigt dabei die aktuell verwendeten Enzyme an. Rechts oben stehen frei definierbare Gruppen von Enzymen. Die in einer Gruppe enthaltenen enzyme werden durch anw&auml;hlen der Gruppe rechts unten angezeigt.
<p>Es k&ouml;nnen einzelne Enzyme aus dieser Liste, oder alle Enzyme einer Gruppe hinzugef&uuml;gt werden.
<p>Um eine neue Gruppe von Enzymen zu erstellen, oder um Enzyme zu einer bestehenden Gruppe hinzuzuf&uuml;ren, m&uuml;ssen diese Enzyme in der linken Liste ausgew&auml;hlt werden.
<p>Zum Bearbeiten von Enzymgruppen <i>ohne</i> ge&ouml;ffneten Vektor kann dieser Dialog auch &uuml;ber das Men&uuml; "Werkzeuge/Enzym-Editor" aufgerufen werden.
<center><img src="de_restriction_editor.png"></center>


<center><a href="de_main.htm">Startseite</a></center>

</body>

</html>